app/controllers/carts_controller.rb

  def show
    @cart = Cart.find(params[:id])
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "9"]]

  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy
---
SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "8"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 8]]