app/controllers/line_items_controller.rb

  def create
	@cart = current_cart
	product = Product.find(params[:product_id])
	@line_item = @cart.line_items.build
	@line_item.product = product


    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "2"]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Sun, 05 May 2013 16:49:40 UTC +00:00], ["updated_at", Sun, 05 May 2013 16:49:40 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", nil], ["created_at", Sun, 05 May 2013 16:49:41 UTC +00:00], ["product_id", nil], ["updated_at", Sun, 05 May 2013 16:49:41 UTC +00:00]]